{"tweets":["sportspoliticen: CFB: Georgia looks like Alabama East, and that’s not fake news https://t.co/10wjOnbScL https://t.co/nUOb9oCLcN","sportspoliticen: CFB: DaeSean Hamilton becomes Penn State’s all-time reception leader with 180th career catch https://t.co/O9tAq06UYv","@JeffRisdon @DawgPound_Dan @iamcrownfactory I will leave it at that got some CFB to watch. All policy breakers shou… https://t.co/ahB059jZb2","[Postgame Thread] Eastern Washington Defeats Sacramento State 52-31 via /r/CFB https://t.co/t57AczoAFg","[Postgame Thread] Kentucky Defeats Eastern Michigan 24-20 via /r/CFB https://t.co/uFaFyc3mQt","[Postgame Thread] Michigan State Defeats Iowa 17-10 via /r/CFB https://t.co/kTFh0ZDV4q","[Game Thread] Nicholls @ Lamar (8:00PM ET) via /r/CFB https://t.co/bXqj1C3Zqu","[Postgame Thread] Ohio Defeats UMass 58-50 via /r/CFB https://t.co/o3mZzQYIXM","[Postgame Thread] Stanford Defeats Arizona State 34-24 via /r/CFB https://t.co/EzjGAKUYxk","[Postgame Thread] SMU Defeats Connecticut 49-28 via /r/CFB https://t.co/7JPFYFdz1w","[Postgame Thread] Mercer Defeats VMI 49-14 via /r/CFB https://t.co/VpUrD0JyzF","[Game Thread] Washington @ Oregon State (8:00PM ET) via /r/CFB https://t.co/ggkzoJCMQ1","[Game Thread] Clemson @ Virginia Tech (8:00PM ET) via /r/CFB https://t.co/vJQlOLiAKM","[Game Thread] Oklahoma State @ Texas Tech (8:00PM ET) via /r/CFB https://t.co/dw1bGXMXmx","[Postgame Thread] Florida State Defeats Wake Forest 26-19 via /r/CFB https://t.co/qcQHNTsrcR","[Postgame Thread] Wyoming Defeats Texas State 45-10 via /r/CFB https://t.co/q1jC5Dlc99","[Postgame Thread] Penn State Defeats Indiana 45-14 via /r/CFB https://t.co/bKVdeOwrCu","[Postgame Thread] Kansas State Defeats Baylor 33-20 via /r/CFB https://t.co/4aQi4RE2Lb","[Game Thread] Ball State @ Western Michigan (7:00PM ET) via /r/CFB https://t.co/As7l0jClgs","[Postgame Thread] Georgia Defeats Tennessee 41-0 via /r/CFB https://t.co/NMJme819Yk","[Postgame Thread] Navy Defeats Tulsa 31-21 via /r/CFB https://t.co/QrwpCCfPSQ","[Postgame Thread] Buffalo Defeats Kent State 27-13 via /r/CFB https://t.co/geDqvP4y39","I swear that, by the time this CFB season is over, i will hate everyone in this Nissan ad.","[Postgame Thread] Eastern Washington Defeats Sacramento State 52-31 via /r/CFB https://t.co/vDPhdAUnio","[Postgame Thread] Kentucky Defeats Eastern Michigan 24-20 via /r/CFB https://t.co/i3WCHsUrZl","[Postgame Thread] Michigan State Defeats Iowa 17-10 via /r/CFB https://t.co/HVnIE3CUUk","[Game Thread] Nicholls @ Lamar (8:00PM ET) via /r/CFB https://t.co/A1dc11q0qH","[Postgame Thread] Ohio Defeats UMass 58-50 via /r/CFB https://t.co/INRIV30zAp","[Postgame Thread] Stanford Defeats Arizona State 34-24 via /r/CFB https://t.co/IkzVQR2WQG","Former Bear I remember him lowkey was raw af https://t.co/1w60PAmsMJ","#CollegeFootball #Northwestern #Wildcats #CFB https://t.co/yrnudaNBwZ","Watching CFB makes me never want to buy a Nissan. Ever. #CLEMvsVT https://t.co/nfPRKFXDJz","@11W He can break every record in CFB and he still won't be great.","Saturday so lit that I'm borrowing Dad-in-Law's Old Navy sweatshirt + watching CFB on mute while Mom-in-Law plays John Legend on her iPad?","Austin hall is that man!!🔵⚪️ best tackler in CFB no doubt 🤷🏽‍♀️ @hallaustin_25","CFB '17 Week 5 (Part 3) #MSSTvsAUB #SCvsTAMU #CLEMvsVT #OKSTvsTTU &amp; #MISSvsBAMA at 9 watching a bit now! 😍🐶🦃🐔👺💙🏈📺🕒","Va Tech got the second most lit entrance in CFB behind Clemson","@Ryan_Keiran The NFL's issue is having Bowling Green @ Ball State play in isolated slots. Big brand vs big brand. H… https://t.co/OVx2T6v1aE","#CFB consolidated game day account. From the tailgate to the tight finish. All right here. Get on board now.","Virginia Tech has the best entrance and best stadium nickname in all of CFB, \"Welcome to the Terrerdome!\"","Saquon Barkley is better NFL prospect, but don't get how Bryce Love isn't the Heisman frontrunner. Maybe the best S… https://t.co/7MEHjZJAJc","Virginia Tech has the best entrance and best stadium nickname in all of CFB, \"Welcome to the Terrordome!\"","VT Tech Enter Sandman is one of the coldest entrances in CFB","Best entrance in CFB on deck. #LetsGo #EnterSandman #EnterVictory #GoHokies","Who picks the hype music for the CFB matchup previews?? Really shouldn't be Taylor swift every time","On the bright side. Va Tech back in prime time. Best entrance in CFB.","CFB stadium entrances &gt;","I really like this QB class in 2017. I think Rudolph and Rosen have very bright futures. #CFB","VT might have the dopest entrance to a game in CFB","Fuck I LOVE COLLEGE FOOTBALL!!!!! CFB&gt;&gt;&gt; NFL","@Cianaf You not watch CFB?","VT has the best entrance in CFB.","What makes him the better NFL prospect? https://t.co/UwSiZAvYTo","CFB atmosphere&gt;&gt;","No better entrance in all of CFB than #Hokies entering Lane Stadium!  #Metallica #EnterSandman","Virginia Tech is absolutely lit right now for this game. One of the coolest entrances in all of CFB!","Best entrance in CFB barred none","VT walking in to Enter Sandman is the most hype entrance in CFB","@BarstoolBigCat i still have that and Wisconsin for my CFB bucket list. Seen Bama-LSU and the Iron bowl live. Been… https://t.co/MZkl9JK4J9","Man I love college football.. one of the best entrances in CFB","Okay that entrance is the best in cfb","Va Tech is hyped up. #CFB #","I think for these ridiculously awesome CFB entrances they should bring the visiting team out first to have to watch and feel it","If yippy don't get amped up watching the Hokies come out you do not love cfb..great atmosphere..but nothing Tigers haven't seen before","That's the best entrance in @CFB . If you've ever been in #LaneStadium when that song comes on, you'll agree","VT has the best entrance in CFB. I love clemson's but it's just so slow :/ Enter Sandman freaking RULES","Espn Saturday night prime time for CFB does the pre game build up better than any other broadcast on tv.","VT has one of the top 5 entrances in #cfb #EnterSandman #CLEMvsVT","VT has the best entrance in CFB","That was quick for Oklahoma State and James Washington, looks like the Cowboys will have a HUGE night #CFB #B12","I love food and football! Time for Clemson at Virginia Tech! #chusky #cfb @ Charlotte, North… https://t.co/wCQ4YqeGit","A away game in CFB may be a harder game then any away game in any sport","Easily the greatest entrance in CFB","Lane Stadium is the most underrated stadium in all of CFB and Virginia Tech has the most underrated fans","Cfb is based on how bad you whoop teams so im still confused on why urban put 3rd stringers in lasst week allowing 14 extra points. I hope…","Va Tech is hyped up. #CFB","Virginia tech has the best entrance in cfb","Have you guys seen Memphis’s helmets? 💯🔥💯🔥 #CFB","Going to be a tuff crowd tonight at #VirginiaTech but I still think #Clemson has enough. #CLEMvsVT #CFB #ACCFootball","Nothing like seeing the pregame traditions across the country each Saturday, and the #Hokies entrance as unique as they come. #CFB","I’ve been to a lot of CFB stadiums and seen a lot of entrances, Virginia Tech is so many miles beyond everyone else it is hilarious.","@Maxallica Virginia Tech c'est quand même mon entrée préférée en CFB.","Blacksburg is definitely a bucket list gameday experience for me. That place looks so hype. #CFB","Seeing the hokie nation was electrifying in the stands WOW #CFB #vt","Alabama vs Ole Miss Live Stream Free ESPN NCAA College Football.  Reddit Source: https://t.co/z8bmNn0cGZ  #CollegeFootball #NCAA #CFB","I hope Vtech shows up that stadium is nuts when they are good enter sandman entrance is one of the best in cfb period","@VBCaneFan Best in CFB","VT might have one of the most ELECTRIC traditions in all of CFB. Earthshaking crowd jamming to Enter Sandman. GREAT stuff. #CFBNight","@GoGreenSports great day of picks for cfb! Keep that money coming! $$$$","@MarkPacker @ESPNUonSiriusXM @ChildersRadio @BradenGall One of the greatest entrances in #CFB! #VaTech #EnterSandman #HokieStone","Ed Orgeron and Butch Jones are two of the biggest douchebag coaches in CFB. Happy to see both their teams are hot garbage! #LSU #tenn blow!","Irish kickin'ass. #cfb","Va Tech always with the most🔥football intro in CFB. Glad to have experienced it.","Nevada vs Fresno State Live Stream Free ESPN NCAA College Football.  Reddit Source: https://t.co/MutaoRdkIu  #CollegeFootball #NCAA #CFB","@Crawdad_86Nole @dat_dj Man Matthews gonna be the best athlete on the team &amp; CFB watch","@TainoEee Nothing better then CFB. I love that shit..","🏈Saturday Premium #CFB 🏈   💥2-0 | +2U So Far Today💥  💰UGA -9.5 (-120)💰 💰Iowa Un44.5 (-120)💰 ♦️VT +7.5 (-110) *1U* ♦️OK ST. -10 (-120) *1U*","Virginia Tech wins the best CFB entrance of the year.","Added it to the CFB bucket list https://t.co/g17xfLYIo9","It doesn’t get better than the VaTech entrance.  CFB at its finest #CLEMvsVT","Petrino hopes 'friend' Jurich remains L'ville AD https://t.co/FBKr1V0Pk4 via @espn #CFB https://t.co/Rj41fJyanz","@Kroeger If there is a better coordinator in CFB, can't imagine who it is.","I guess Dalvin Cook skipped CFB https://t.co/aiAK3O0761","@JohnnnyVegas @RichCirminiello Thanks Johnny glad u liked it...just trying to put out quality content and entertain our audience talking cfb","@ClayTravis Hey but at least CBS is getting the sweetest deal in CFB to air them.","I want to meet someone one day that loves me as much as Brent Venables snorting coke before a game. #CLEMvsVT #CFB","Troy is now up 17-0 against LSU. In Death Valley.   \"You look at these scores across CFB and it just scares you to death.\" -- Mack Brown","Per @JimmyVaccaro on late CFB: @southpointlv sportsbook needs VATECH and RUTGERS. But really no huge decisions. @Covers","@kbright_ there is no illegal contact rule in CFB.","a lot of trash CFB games.","Yesterday a CFB coaches agent called me. All he said was \"LSU hired Ed Orgeron.\" We laughed for a few minutes.","Danger is our middle name https://t.co/uSyu9ghNn3","@jmunderwood64 @krambman @MattBaxendell People using career QB records arguments don't get the CFB era we are in. A… https://t.co/wC0qqVTAFX","CFB:  Alabama -30","Sports Photos! #NCAAF #CFB #IOWAvsMSU - by @adammruff: https://t.co/rNvMfvWXYO","#OklahomaState vs. #TexasTech LIVE Betting #CFB Odds (@BovadaLV)  https://t.co/1VuV0ofXOz https://t.co/ZG1xLUf7Zr","We’ve been laughing for months https://t.co/Pc158Y2wqH","Umm, Troy is up 17-0 in the third quarter at LSU. Hope Coach O didn't buy a house. #CFB","15th Massive Play of the Day: CFB Mississippi vs Alabama: Alabama -28.5 #TrustKingArnsaw https://t.co/VDPAW3nZ92","#SunBelt Trending yet?  #CFB #gamblingtwitter","@davmilee @KirkHerbstreit You don't ask yourself hmmm - I wonder why literally no other CFB analysts are saying what i am saying??","@dish @FNTSYSportsNet @GOFORTHE2 joe Lisi the best in the biz! No one knows more CFB than him! On fire today.","@MemphoNewsLady @ArcMidSouth @GibsonsDonuts Why do you have to show donuts 🍩 and mess up a good CFB Saturday night? I never! #WDE","#CFB #D3FB #SmallCollegeFootball #WIAC: Wisconsin-LaCrosse 28, Wisconsin-Stevens Point 0 (8:25, 3rd Quarter).","How bad is #LSU? They're currently down 3 scores to the Dollar General Champions, #Troy. #LSUvsTROY #CFB","[r/CFB] [Game Thread] Nevada @ Fresno State (10:00PM ET) https://t.co/8b5DJqq26c","Right NOW @dannykanell joins @1TomByrne to talk about all of today's action in CFB! https://t.co/zyLH59e8gL","[Game Thread] Nevada @ Fresno State (10:00PM ET) via /r/CFB https://t.co/3yXppkxT8m","[Postgame Thread] Notre Dame Defeats Miami (OH) 52-17 via /r/CFB https://t.co/YBEUkPCkK7","Shade of the highest order https://t.co/MUlgVj6Vgr","Troy's beating LSU 17-0 right now. Troy OL no. 59 Jay Dye did an AMA on /r/CFB last year. https://t.co/mlf8af7NPH","@darrenrovell Darrell pretending he watches cfb games.  PRICELESS.  😭😭😭","@haggerty75 are you as tired of CFB as I am?","@Spikebone17 I know you well, my friend. We gotta watch some CFB this year. My wife will be out of town next week i… https://t.co/ysptUIiXFW","#22 Notre Dame defeats Miami (OH) 52-17 #FightingIrish #RedHawks #APTop25 #FBS #CFB","Second half of @MT_FB + @FAU_Football can be seen NOW.  FREE CFB for #cordcutters thanks to @WatchStadium https://t.co/Koc2IJUgIT","@SportsCenter @ESPNCFB @FCS_STATS @FCS_Insider @FCS_Football @FOXSports @CBSCFB @CFB https://t.co/DbGilfl170","気候編 Cfbは西岸海洋性気候！ 偏西風の影響をうける","OMG! Can LSU Fire a coach so early in the season? They are losing to Troy 17-0 early in the 3rd. #facepalm #cfb","Playing in Baton Rogue at night used to be one of the toughest things to do in CFB. Troy making it look easy. #TroyvLSU","CFB Top 25 good thing you guys wanted Les Miles out! @lsu @LSUfootball @GeauxTigers #LSU #LSUvsTROY @LSUFANSDOTCOM  https://t.co/cT3BH54T7c","One of the many reasons CFB &gt; NFL....the traditions. 🙌 https://t.co/cjDMraDPMF","Is it Basketball season yet? https://t.co/RVI5c3fqHE","FSU : the most flawed team in #CFB ,talent abounds, coaching  suspect at best @Ballou1010xl  @aborgesNYR","Upcoming #cfb action: 21:30 - California Golden Bears vs Oregon Ducks #CALvsORE https://t.co/cproIgUB0T","Bryce Love for the #Heisman #CFB #GoStanford 🌲🏈 @StanfordFball https://t.co/sgieN8ssw5","@dandydonlsu We are the worst team in CFB.","@Lance_Sells Not only would the SEC be better but CFB would be better for it. We'll get there.","Why the fuck do I continue to bet on CFB I hope your school burns @LSUfootball","@BallForever8 Derwin James sorry asf talm bout he the best player in cfb","[Game Thread] Nevada @ Fresno State (10:00PM ET) via /r/CFB https://t.co/jVZJDpf84I","[Postgame Thread] Notre Dame Defeats Miami (OH) 52-17 via /r/CFB https://t.co/oF00txFbJu","Ready for the NBA season to start CFB trash and a 40 year old man still running the NFL (Tom Brady) lol","Don't want to say we discussed the possibility of Troy doing this in our Other CFB Games article yesterday, but...","Why is this #MSSTvsAUB foolery still in my TV. I'm missing kickoff. Seriously, #CFB programmers. Do better. 😠 #BAMA #MISSvsBAMA","😎 🏈 #CFB https://t.co/cch80eBIlf","😭😭😭😭😭 https://t.co/P2uQykJIIX","Why is this #MSSTvsAUB foolery still on my TV?!? I'm missing kickoff. Seriously, #CFB programmers. Do better. 😠 #BAMA #MISSvsBAMA","Go fuck yourself https://t.co/E6RzjYjhJI","What kinda stats is these in 5 games!!? https://t.co/3uGiIQHFQF","i remember when usc wanted to hire him lol https://t.co/NtGOuXXJKl","RT Covers \"RT Covers_Vegas: Per JimmyVaccaro on late CFB: southpointlv sportsbook needs VATECH and RUTGERS. But really no huge decisions. C…","MMSPicks final 2 #CFB #picks for Saturday were at 8pm  Texas Tech +10.5 Ok St Ok St/texas Tech O84.0  #cfbpicks #ncaafpicks #collegefootball","@sanichols https://t.co/JLWzNxQxQi","Well you could be watching something worse 🤔 Watching a poorly played MU game even w/good officiating😂 #Don'tLookAG… https://t.co/XxxtESJkoa","In non CFB news, I'm looking forward to seeing Jackie Chan be super serious about ass kicking.","Best CFB team in Florida is #UCF no doubt. #ChargeOn #UCFvsMemphis","You don't know the voters. And Penn State isn't exactly beloved by a lot of people. I think he's the best all-aroun… https://t.co/spP1yxM0T9","#CFB #GroupOf5 #SunBelt: Louisiana-Monroe 38, Coastal Carolina 30 (10:11, 3rd Quarter) https://t.co/ZIhGQGxDE4","It’s Time for Oklahoma State Cowboys Football Wall Clock #NCAA #cfb #okstate #OSUvsTTU #CowboyUp… https://t.co/nes0iJ3EZR","@FordhamNYC @WaynesburgU #todayinhistory #sportshistory #history #fordham #waynesburg #tv #television #nbc… https://t.co/73mxLjgDNH","I'm creating this hash tag before someone else does #BringBackGerryDinardo #LSU #CFB @LSUFreek @TBob53 https://t.co/RJEfWh4cei","Texas Tech play one heck of a game so far against Oklahoma St. #CFB","Best CFB stadium I've ever been to behind Dowdy-Fick and Boulder https://t.co/JhNPh3YGqU","@GrantRamey Somebody has to score eventually.... Or they'll force the NCAA to bring back ties iN CFB","Too many panic hires. Lack original thought. Time for teams to stop hiring saban disciples &amp; make their own way.  CFB silly season🙌🙌","I'm not as much of a Charles Kelly hater as most in our fan base, my biggest problem with him is that he is the \"Gus Bradley\" of CFB..","The new normal in sports TV -- cutting off the end of a blowout to get to the start of the next game. ESPN's been doing it all CFB season.","28-0 3:24 left in second half #GoBucks  #OhioState  #CFB https://t.co/hyTc9A8Jre","#CFB #GroupOf5 #MAC: Western Michigan 38, Ball State 3 (10:18, 3rd Quarter)","Good &amp; Bad being a top CFB program. Win Big against unranked opponents, “you’re supposed to beat them”. Win narrowly, “Usuck, u barely won”","#Auburn taking down #SEC opponent #MissST with ease.42-10 Auburn halfway through the 4th #CFB","Sucks when the best CFB game of the week is on Friday night at 10:30","CORRECTION on our first *VIP* Winner...  #TFC played the #RedBulls not the #Impact  4 more VIPs still pending... 3… https://t.co/TyTqhulNNs","@drakegreen24 Best entrance in CFB","#Bama looks to stay at the top of the ranks and undefeated in an #SEC matchup vs #OleMiss #CFB","I know you have moved on...but I wanted to remind you that you were one of the best defensive players I've watched in cfb @TheRealJavJones","So far the #CFB weekend has been a bit wild: #Trojans fell to WSU, #LSU trailing... Troy by 17...","I think I'm gonna go back to school for journalism! I really wanna be a #cfb analyst! Oh well, 3 education degrees for nothing lol! #godawgs","CFB: WATCH: Ohio State scores one of the easiest touchdowns you’ll see https://t.co/OshL5MbkY6","CFB: RT SDS: https://t.co/vZeZ1daWYN","How is this score still 14-14. Feels like going forever! #cfb  #OSUvsTTU","James Franklin turned PSU from a torn apart team to possible CFB Playoff team. Respect","Yeeeeeeeawwwwwwwwwn!   Jeez CFB seems so lame when you're team has a bye.","I wrote about Minkah Fitzpatrick , BAMA DB here #Titans fans should check it out now before he makes a big play https://t.co/JooByooypf","Saw a Tennessee fan say they'd hire Briles... some people's morals really go out the window just to win in CFB","Caught that @joywavemusic on the Fox CFB bumper music","I don’t hate him, but he can’t teach pattern matching. That automatically disqualified him from a milli + per year… https://t.co/Q0hSNu6uS1","@MattViator give him a call ! ULM https://t.co/c3iYKOAqwY","Here's our 4th of 4 #Gold Play #CFB Gm4 #Old Miss@#Bama ov 55.5 Enjoy the rest of the week."]}