{"tweets":["sportspoliticen: CFB: Georgia looks like Alabama East, and that’s not fake news https://t.co/10wjOnbScL https://t.co/nUOb9oCLcN","sportspoliticen: CFB: DaeSean Hamilton becomes Penn State’s all-time reception leader with 180th career catch https://t.co/O9tAq06UYv","@JeffRisdon @DawgPound_Dan @iamcrownfactory I will leave it at that got some CFB to watch. All policy breakers shou… https://t.co/ahB059jZb2","[Postgame Thread] Eastern Washington Defeats Sacramento State 52-31 via /r/CFB https://t.co/t57AczoAFg","[Postgame Thread] Kentucky Defeats Eastern Michigan 24-20 via /r/CFB https://t.co/uFaFyc3mQt","[Postgame Thread] Michigan State Defeats Iowa 17-10 via /r/CFB https://t.co/kTFh0ZDV4q","[Game Thread] Nicholls @ Lamar (8:00PM ET) via /r/CFB https://t.co/bXqj1C3Zqu","[Postgame Thread] Ohio Defeats UMass 58-50 via /r/CFB https://t.co/o3mZzQYIXM","[Postgame Thread] Stanford Defeats Arizona State 34-24 via /r/CFB https://t.co/EzjGAKUYxk","[Postgame Thread] SMU Defeats Connecticut 49-28 via /r/CFB https://t.co/7JPFYFdz1w","[Postgame Thread] Mercer Defeats VMI 49-14 via /r/CFB https://t.co/VpUrD0JyzF","[Game Thread] Washington @ Oregon State (8:00PM ET) via /r/CFB https://t.co/ggkzoJCMQ1","[Game Thread] Clemson @ Virginia Tech (8:00PM ET) via /r/CFB https://t.co/vJQlOLiAKM","[Game Thread] Oklahoma State @ Texas Tech (8:00PM ET) via /r/CFB https://t.co/dw1bGXMXmx","[Postgame Thread] Florida State Defeats Wake Forest 26-19 via /r/CFB https://t.co/qcQHNTsrcR","[Postgame Thread] Wyoming Defeats Texas State 45-10 via /r/CFB https://t.co/q1jC5Dlc99","[Postgame Thread] Penn State Defeats Indiana 45-14 via /r/CFB https://t.co/bKVdeOwrCu","[Postgame Thread] Kansas State Defeats Baylor 33-20 via /r/CFB https://t.co/4aQi4RE2Lb","[Game Thread] Ball State @ Western Michigan (7:00PM ET) via /r/CFB https://t.co/As7l0jClgs","[Postgame Thread] Georgia Defeats Tennessee 41-0 via /r/CFB https://t.co/NMJme819Yk","[Postgame Thread] Navy Defeats Tulsa 31-21 via /r/CFB https://t.co/QrwpCCfPSQ","[Postgame Thread] Buffalo Defeats Kent State 27-13 via /r/CFB https://t.co/geDqvP4y39","I swear that, by the time this CFB season is over, i will hate everyone in this Nissan ad.","[Postgame Thread] Eastern Washington Defeats Sacramento State 52-31 via /r/CFB https://t.co/vDPhdAUnio","[Postgame Thread] Kentucky Defeats Eastern Michigan 24-20 via /r/CFB https://t.co/i3WCHsUrZl","[Postgame Thread] Michigan State Defeats Iowa 17-10 via /r/CFB https://t.co/HVnIE3CUUk","[Game Thread] Nicholls @ Lamar (8:00PM ET) via /r/CFB https://t.co/A1dc11q0qH","[Postgame Thread] Ohio Defeats UMass 58-50 via /r/CFB https://t.co/INRIV30zAp","[Postgame Thread] Stanford Defeats Arizona State 34-24 via /r/CFB https://t.co/IkzVQR2WQG","Former Bear I remember him lowkey was raw af https://t.co/1w60PAmsMJ","#CollegeFootball #Northwestern #Wildcats #CFB https://t.co/yrnudaNBwZ","Watching CFB makes me never want to buy a Nissan. Ever. #CLEMvsVT https://t.co/nfPRKFXDJz","@11W He can break every record in CFB and he still won't be great.","Saturday so lit that I'm borrowing Dad-in-Law's Old Navy sweatshirt + watching CFB on mute while Mom-in-Law plays John Legend on her iPad?","Austin hall is that man!!🔵⚪️ best tackler in CFB no doubt 🤷🏽‍♀️ @hallaustin_25","CFB '17 Week 5 (Part 3) #MSSTvsAUB #SCvsTAMU #CLEMvsVT #OKSTvsTTU &amp; #MISSvsBAMA at 9 watching a bit now! 😍🐶🦃🐔👺💙🏈📺🕒","Va Tech got the second most lit entrance in CFB behind Clemson","@Ryan_Keiran The NFL's issue is having Bowling Green @ Ball State play in isolated slots. Big brand vs big brand. H… https://t.co/OVx2T6v1aE","#CFB consolidated game day account. From the tailgate to the tight finish. All right here. Get on board now.","Virginia Tech has the best entrance and best stadium nickname in all of CFB, \"Welcome to the Terrerdome!\"","Saquon Barkley is better NFL prospect, but don't get how Bryce Love isn't the Heisman frontrunner. Maybe the best S… https://t.co/7MEHjZJAJc","Virginia Tech has the best entrance and best stadium nickname in all of CFB, \"Welcome to the Terrordome!\"","VT Tech Enter Sandman is one of the coldest entrances in CFB","Best entrance in CFB on deck. #LetsGo #EnterSandman #EnterVictory #GoHokies","Who picks the hype music for the CFB matchup previews?? Really shouldn't be Taylor swift every time","On the bright side. Va Tech back in prime time. Best entrance in CFB.","CFB stadium entrances &gt;","I really like this QB class in 2017. I think Rudolph and Rosen have very bright futures. #CFB","VT might have the dopest entrance to a game in CFB","Fuck I LOVE COLLEGE FOOTBALL!!!!! CFB&gt;&gt;&gt; NFL","@Cianaf You not watch CFB?","VT has the best entrance in CFB.","What makes him the better NFL prospect? https://t.co/UwSiZAvYTo","CFB atmosphere&gt;&gt;","No better entrance in all of CFB than #Hokies entering Lane Stadium!  #Metallica #EnterSandman","Virginia Tech is absolutely lit right now for this game. One of the coolest entrances in all of CFB!","Best entrance in CFB barred none","VT walking in to Enter Sandman is the most hype entrance in CFB","@BarstoolBigCat i still have that and Wisconsin for my CFB bucket list. Seen Bama-LSU and the Iron bowl live. Been… https://t.co/MZkl9JK4J9","Man I love college football.. one of the best entrances in CFB","Okay that entrance is the best in cfb","Va Tech is hyped up. #CFB #","I think for these ridiculously awesome CFB entrances they should bring the visiting team out first to have to watch and feel it","If yippy don't get amped up watching the Hokies come out you do not love cfb..great atmosphere..but nothing Tigers haven't seen before","That's the best entrance in @CFB . If you've ever been in #LaneStadium when that song comes on, you'll agree","VT has the best entrance in CFB. I love clemson's but it's just so slow :/ Enter Sandman freaking RULES","Espn Saturday night prime time for CFB does the pre game build up better than any other broadcast on tv.","VT has one of the top 5 entrances in #cfb #EnterSandman #CLEMvsVT","VT has the best entrance in CFB","That was quick for Oklahoma State and James Washington, looks like the Cowboys will have a HUGE night #CFB #B12","I love food and football! Time for Clemson at Virginia Tech! #chusky #cfb @ Charlotte, North… https://t.co/wCQ4YqeGit","A away game in CFB may be a harder game then any away game in any sport","Easily the greatest entrance in CFB","Lane Stadium is the most underrated stadium in all of CFB and Virginia Tech has the most underrated fans","Cfb is based on how bad you whoop teams so im still confused on why urban put 3rd stringers in lasst week allowing 14 extra points. I hope…","Va Tech is hyped up. #CFB","Virginia tech has the best entrance in cfb","Have you guys seen Memphis’s helmets? 💯🔥💯🔥 #CFB","Going to be a tuff crowd tonight at #VirginiaTech but I still think #Clemson has enough. #CLEMvsVT #CFB #ACCFootball","Nothing like seeing the pregame traditions across the country each Saturday, and the #Hokies entrance as unique as they come. #CFB","I’ve been to a lot of CFB stadiums and seen a lot of entrances, Virginia Tech is so many miles beyond everyone else it is hilarious.","@Maxallica Virginia Tech c'est quand même mon entrée préférée en CFB.","Blacksburg is definitely a bucket list gameday experience for me. That place looks so hype. #CFB","Seeing the hokie nation was electrifying in the stands WOW #CFB #vt","Alabama vs Ole Miss Live Stream Free ESPN NCAA College Football.  Reddit Source: https://t.co/z8bmNn0cGZ  #CollegeFootball #NCAA #CFB","I hope Vtech shows up that stadium is nuts when they are good enter sandman entrance is one of the best in cfb period","@VBCaneFan Best in CFB","VT might have one of the most ELECTRIC traditions in all of CFB. Earthshaking crowd jamming to Enter Sandman. GREAT stuff. #CFBNight","@GoGreenSports great day of picks for cfb! Keep that money coming! $$$$","@MarkPacker @ESPNUonSiriusXM @ChildersRadio @BradenGall One of the greatest entrances in #CFB! #VaTech #EnterSandman #HokieStone","Ed Orgeron and Butch Jones are two of the biggest douchebag coaches in CFB. Happy to see both their teams are hot garbage! #LSU #tenn blow!","Irish kickin'ass. #cfb","Va Tech always with the most🔥football intro in CFB. Glad to have experienced it.","Nevada vs Fresno State Live Stream Free ESPN NCAA College Football.  Reddit Source: https://t.co/MutaoRdkIu  #CollegeFootball #NCAA #CFB","@Crawdad_86Nole @dat_dj Man Matthews gonna be the best athlete on the team &amp; CFB watch","@TainoEee Nothing better then CFB. I love that shit..","🏈Saturday Premium #CFB 🏈   💥2-0 | +2U So Far Today💥  💰UGA -9.5 (-120)💰 💰Iowa Un44.5 (-120)💰 ♦️VT +7.5 (-110) *1U* ♦️OK ST. -10 (-120) *1U*","Virginia Tech wins the best CFB entrance of the year.","Added it to the CFB bucket list https://t.co/g17xfLYIo9","It doesn’t get better than the VaTech entrance.  CFB at its finest #CLEMvsVT","Petrino hopes 'friend' Jurich remains L'ville AD https://t.co/FBKr1V0Pk4 via @espn #CFB https://t.co/Rj41fJyanz","@Kroeger If there is a better coordinator in CFB, can't imagine who it is.","I guess Dalvin Cook skipped CFB https://t.co/aiAK3O0761","@JohnnnyVegas @RichCirminiello Thanks Johnny glad u liked it...just trying to put out quality content and entertain our audience talking cfb","@ClayTravis Hey but at least CBS is getting the sweetest deal in CFB to air them.","I want to meet someone one day that loves me as much as Brent Venables snorting coke before a game. #CLEMvsVT #CFB","Troy is now up 17-0 against LSU. In Death Valley.   \"You look at these scores across CFB and it just scares you to death.\" -- Mack Brown","Per @JimmyVaccaro on late CFB: @southpointlv sportsbook needs VATECH and RUTGERS. But really no huge decisions. @Covers","@kbright_ there is no illegal contact rule in CFB.","a lot of trash CFB games.","Yesterday a CFB coaches agent called me. All he said was \"LSU hired Ed Orgeron.\" We laughed for a few minutes.","Danger is our middle name https://t.co/uSyu9ghNn3","@jmunderwood64 @krambman @MattBaxendell People using career QB records arguments don't get the CFB era we are in. A… https://t.co/wC0qqVTAFX","CFB:  Alabama -30","Sports Photos! #NCAAF #CFB #IOWAvsMSU - by @adammruff: https://t.co/rNvMfvWXYO","#OklahomaState vs. #TexasTech LIVE Betting #CFB Odds (@BovadaLV)  https://t.co/1VuV0ofXOz https://t.co/ZG1xLUf7Zr","We’ve been laughing for months https://t.co/Pc158Y2wqH","Umm, Troy is up 17-0 in the third quarter at LSU. Hope Coach O didn't buy a house. #CFB","15th Massive Play of the Day: CFB Mississippi vs Alabama: Alabama -28.5 #TrustKingArnsaw https://t.co/VDPAW3nZ92","#SunBelt Trending yet?  #CFB #gamblingtwitter","@davmilee @KirkHerbstreit You don't ask yourself hmmm - I wonder why literally no other CFB analysts are saying what i am saying??","@dish @FNTSYSportsNet @GOFORTHE2 joe Lisi the best in the biz! No one knows more CFB than him! On fire today.","@MemphoNewsLady @ArcMidSouth @GibsonsDonuts Why do you have to show donuts 🍩 and mess up a good CFB Saturday night? I never! #WDE","#CFB #D3FB #SmallCollegeFootball #WIAC: Wisconsin-LaCrosse 28, Wisconsin-Stevens Point 0 (8:25, 3rd Quarter).","How bad is #LSU? They're currently down 3 scores to the Dollar General Champions, #Troy. #LSUvsTROY #CFB","[r/CFB] [Game Thread] Nevada @ Fresno State (10:00PM ET) https://t.co/8b5DJqq26c","Right NOW @dannykanell joins @1TomByrne to talk about all of today's action in CFB! https://t.co/zyLH59e8gL","[Game Thread] Nevada @ Fresno State (10:00PM ET) via /r/CFB https://t.co/3yXppkxT8m","[Postgame Thread] Notre Dame Defeats Miami (OH) 52-17 via /r/CFB https://t.co/YBEUkPCkK7","Shade of the highest order https://t.co/MUlgVj6Vgr","Troy's beating LSU 17-0 right now. Troy OL no. 59 Jay Dye did an AMA on /r/CFB last year. https://t.co/mlf8af7NPH","@darrenrovell Darrell pretending he watches cfb games.  PRICELESS.  😭😭😭","@haggerty75 are you as tired of CFB as I am?","@Spikebone17 I know you well, my friend. We gotta watch some CFB this year. My wife will be out of town next week i… https://t.co/ysptUIiXFW","#22 Notre Dame defeats Miami (OH) 52-17 #FightingIrish #RedHawks #APTop25 #FBS #CFB","Second half of @MT_FB + @FAU_Football can be seen NOW.  FREE CFB for #cordcutters thanks to @WatchStadium https://t.co/Koc2IJUgIT","@SportsCenter @ESPNCFB @FCS_STATS @FCS_Insider @FCS_Football @FOXSports @CBSCFB @CFB https://t.co/DbGilfl170","気候編 Cfbは西岸海洋性気候！ 偏西風の影響をうける","OMG! Can LSU Fire a coach so early in the season? They are losing to Troy 17-0 early in the 3rd. #facepalm #cfb","Playing in Baton Rogue at night used to be one of the toughest things to do in CFB. Troy making it look easy. #TroyvLSU","CFB Top 25 good thing you guys wanted Les Miles out! @lsu @LSUfootball @GeauxTigers #LSU #LSUvsTROY @LSUFANSDOTCOM  https://t.co/cT3BH54T7c","One of the many reasons CFB &gt; NFL....the traditions. 🙌 https://t.co/cjDMraDPMF","Is it Basketball season yet? https://t.co/RVI5c3fqHE","FSU : the most flawed team in #CFB ,talent abounds, coaching  suspect at best @Ballou1010xl  @aborgesNYR","Upcoming #cfb action: 21:30 - California Golden Bears vs Oregon Ducks #CALvsORE https://t.co/cproIgUB0T","Bryce Love for the #Heisman #CFB #GoStanford 🌲🏈 @StanfordFball https://t.co/sgieN8ssw5","@dandydonlsu We are the worst team in CFB.","@Lance_Sells Not only would the SEC be better but CFB would be better for it. We'll get there.","Why the fuck do I continue to bet on CFB I hope your school burns @LSUfootball","@BallForever8 Derwin James sorry asf talm bout he the best player in cfb","[Game Thread] Nevada @ Fresno State (10:00PM ET) via /r/CFB https://t.co/jVZJDpf84I","[Postgame Thread] Notre Dame Defeats Miami (OH) 52-17 via /r/CFB https://t.co/oF00txFbJu","Ready for the NBA season to start CFB trash and a 40 year old man still running the NFL (Tom Brady) lol","Don't want to say we discussed the possibility of Troy doing this in our Other CFB Games article yesterday, but...","Why is this #MSSTvsAUB foolery still in my TV. I'm missing kickoff. Seriously, #CFB programmers. Do better. 😠 #BAMA #MISSvsBAMA","😎 🏈 #CFB https://t.co/cch80eBIlf","😭😭😭😭😭 https://t.co/P2uQykJIIX","Why is this #MSSTvsAUB foolery still on my TV?!? I'm missing kickoff. Seriously, #CFB programmers. Do better. 😠 #BAMA #MISSvsBAMA","Go fuck yourself https://t.co/E6RzjYjhJI","What kinda stats is these in 5 games!!? https://t.co/3uGiIQHFQF","i remember when usc wanted to hire him lol https://t.co/NtGOuXXJKl","RT Covers \"RT Covers_Vegas: Per JimmyVaccaro on late CFB: southpointlv sportsbook needs VATECH and RUTGERS. But really no huge decisions. C…","MMSPicks final 2 #CFB #picks for Saturday were at 8pm  Texas Tech +10.5 Ok St Ok St/texas Tech O84.0  #cfbpicks #ncaafpicks #collegefootball","@sanichols https://t.co/JLWzNxQxQi","Well you could be watching something worse 🤔 Watching a poorly played MU game even w/good officiating😂 #Don'tLookAG… https://t.co/XxxtESJkoa","In non CFB news, I'm looking forward to seeing Jackie Chan be super serious about ass kicking.","Best CFB team in Florida is #UCF no doubt. #ChargeOn #UCFvsMemphis","You don't know the voters. And Penn State isn't exactly beloved by a lot of people. I think he's the best all-aroun… https://t.co/spP1yxM0T9","#CFB #GroupOf5 #SunBelt: Louisiana-Monroe 38, Coastal Carolina 30 (10:11, 3rd Quarter) https://t.co/ZIhGQGxDE4","It’s Time for Oklahoma State Cowboys Football Wall Clock #NCAA #cfb #okstate #OSUvsTTU #CowboyUp… https://t.co/nes0iJ3EZR","@FordhamNYC @WaynesburgU #todayinhistory #sportshistory #history #fordham #waynesburg #tv #television #nbc… https://t.co/73mxLjgDNH","I'm creating this hash tag before someone else does #BringBackGerryDinardo #LSU #CFB @LSUFreek @TBob53 https://t.co/RJEfWh4cei","Texas Tech play one heck of a game so far against Oklahoma St. #CFB","Best CFB stadium I've ever been to behind Dowdy-Fick and Boulder https://t.co/JhNPh3YGqU","@GrantRamey Somebody has to score eventually.... Or they'll force the NCAA to bring back ties iN CFB","Too many panic hires. Lack original thought. Time for teams to stop hiring saban disciples &amp; make their own way.  CFB silly season🙌🙌","I'm not as much of a Charles Kelly hater as most in our fan base, my biggest problem with him is that he is the \"Gus Bradley\" of CFB..","The new normal in sports TV -- cutting off the end of a blowout to get to the start of the next game. ESPN's been doing it all CFB season.","28-0 3:24 left in second half #GoBucks  #OhioState  #CFB https://t.co/hyTc9A8Jre","#CFB #GroupOf5 #MAC: Western Michigan 38, Ball State 3 (10:18, 3rd Quarter)","Good &amp; Bad being a top CFB program. Win Big against unranked opponents, “you’re supposed to beat them”. Win narrowly, “Usuck, u barely won”","#Auburn taking down #SEC opponent #MissST with ease.42-10 Auburn halfway through the 4th #CFB","Sucks when the best CFB game of the week is on Friday night at 10:30","CORRECTION on our first *VIP* Winner...  #TFC played the #RedBulls not the #Impact  4 more VIPs still pending... 3… https://t.co/TyTqhulNNs","@drakegreen24 Best entrance in CFB","#Bama looks to stay at the top of the ranks and undefeated in an #SEC matchup vs #OleMiss #CFB","I know you have moved on...but I wanted to remind you that you were one of the best defensive players I've watched in cfb @TheRealJavJones","So far the #CFB weekend has been a bit wild: #Trojans fell to WSU, #LSU trailing... Troy by 17...","I think I'm gonna go back to school for journalism! I really wanna be a #cfb analyst! Oh well, 3 education degrees for nothing lol! #godawgs","CFB: WATCH: Ohio State scores one of the easiest touchdowns you’ll see https://t.co/OshL5MbkY6","CFB: RT SDS: https://t.co/vZeZ1daWYN","How is this score still 14-14. Feels like going forever! #cfb  #OSUvsTTU","James Franklin turned PSU from a torn apart team to possible CFB Playoff team. Respect","Yeeeeeeeawwwwwwwwwn!   Jeez CFB seems so lame when you're team has a bye.","I wrote about Minkah Fitzpatrick , BAMA DB here #Titans fans should check it out now before he makes a big play https://t.co/JooByooypf","Saw a Tennessee fan say they'd hire Briles... some people's morals really go out the window just to win in CFB","Caught that @joywavemusic on the Fox CFB bumper music","I don’t hate him, but he can’t teach pattern matching. That automatically disqualified him from a milli + per year… https://t.co/Q0hSNu6uS1","@MattViator give him a call ! ULM https://t.co/c3iYKOAqwY","Here's our 4th of 4 #Gold Play #CFB Gm4 #Old Miss@#Bama ov 55.5 Enjoy the rest of the week.","@Lance_Sells Not only would the SEC be better for it. We'll get there. #CFB","@annszipszky 😂my mistake. Rutgers is THE worst team in cfb history dating back to the 1800s. Ive never witnessed su… https://t.co/4rGyqPwga2","I know Clemson and Bama look good now, but I've watched too much CFB to know one of those teams won't be as good down the stretch..","@Kirkallmuteteam @cbfowler Thats messed up Kirk, almost been a year &amp; plenty of CFB fans still have no clue bout th… https://t.co/8LH5ZxLV6R","#CFB #D2FB #GSCFB #SmallCollegeFootball: Florida Tech 21, West Florida 20 (End Of 3rd Quarter) https://t.co/hml8fBfQED","[r/CFB] [Game Thread] Colorado @ UCLA (10:30PM ET) https://t.co/TGczRxAaXC","[r/CFB] [Game Thread] San José State @ UNLV (10:30PM ET) https://t.co/kFJ7rKJ9FH","2nd half CFB recommendation between Texas A&amp;M vs South Carolina:  Texas A&amp;M -6","no https://t.co/wsmbwbvjEL","Lmaoo you gotta get passed Jacksonville first which u couldn't even do when we had muschamp😂💀 https://t.co/uPjQyfw6OC","#CFB #D2FB #GAC #SmallCollegeFootball: Ouachita Baptist 35, Arkansas Tech 31 (1:36, 4th Quarter) https://t.co/hwTPzaRAq6","Big really big Saturday CFB night for me @AuburnFootball WINS!@JSUGamecockFB and @TroyTrojansFB both leading and @HokiesFB showing momentum","Only CFB teams I rock with is OkSt and Georgia (Lil cuz on the team) everybody else can play in traffic","I guess I'll just drink the beers in my fridge and watch CFB night games 🤗","CFB washington 2H -12 (2X total)","It’s Time for #Marshall Thundering Herd Football Wall Clock #NCAA #cfb #WeAre #GoHerd @HerdZone… https://t.co/L2Fg5Qenle","It's game day! Start your own pro team! Get former college stars playing for you! #NFL #CFB #SEC #Alamaba #OleMiss… https://t.co/sgSuqNjhyT","#picksix #bamachainsaw is getting warmed up #rtr #cfb","I find particular enjoyment when CFB cameras show the shocked faces of people in the crowd 😂😂","@tpnolefan1 Maybe, but looking at the rest of CFB there’s not much left on the schedule to fear. More likely that o… https://t.co/7oA6Ddk9xe","@MoJoDisney You guys lost 41-0?!?!? Are you firing the coach sometime tonight?!? #GoVols #CFB","@TigerDroppings Literally worst team in cfb. Absolutely pathetic","#Upsetwatch: (25) LSU down 10 to #Troy at the start of the 4th #CFB #LSUvsTroy","@AuburnFootball knocks off @msstate 49-10... RB Kerryon Johnson 116yds rush, 3 TDs (courtesy/Auburn Univ.)… https://t.co/oFgCkb3mI2","Alabama is just on another level than any other team in CFB.","Maryland 31, Minnesota 24 final box score https://t.co/WYOsQqvJgx https://t.co/eBpphA9hk2","Alabama’s defense blocks better for their runners than probably 30% of CFB Offensive lines.","Question 28: One time in CFB history has someone one the Heisman Trophy, and coached a Heisman Tropy winner, who is it?","@JETSpls WNBA preseason&gt;CFB","Those are my exact plays but I'm following @Megalocks  https://t.co/2FPblWLbYr","Who is the best school in CFB at producing star NFL wide receivers? Find out who tops the list! #SportsOpinions… https://t.co/kZJB89ovjZ","@welpskol @_Dame0 @BleacherReport No, he's just the only player in CFB history to have 50 yd TD runs in 7 straight games #ComeGetAllThisLove","ATT Uverse is awful during CFB season.","2nd half CFB recommendation between #Washington vs #OregonSt:  OVER 24.5","CFB Spring Games&gt;NBA Finals https://t.co/AQoVgJuawP","Can we take a second to appreciate how spectacularly dumb it is that sacks are still scored as QB rushing yards in CFB?","Like the Ravens of a few years ago, they play offense without the ball. #BAMA #RollTide #MISSvsBAMA https://t.co/nMgvzv726x","You'd be surprised too when you see it's Rutgers https://t.co/BgaSh7nHN9","Retweeted WorldElite Syndicate (@WorldEliteSyn):  BOOOOOM !!  *VIP* WINNER #3 of 6 #CFB #Zips  So far a perfect... https://t.co/ex9dQEpt3B","VT taking CFB Gameday Signs to the next level! But.... a dog wearing a Vick jersey? Come on man! https://t.co/pIYXzR1QFU","Sports Photos! #NCAAF #CFB #SCvsTAMU #SCARvsTAMU - by @dunnimages: https://t.co/PBBV6MJ1bt","#NCAA #CFB • UNLV -16.5 -115  3 units","@davmilee @KirkHerbstreit You don't know the voters. And Penn State Defeats Indiana 45-14 via /r/CFB https://t.co/fNwSvGVo9j","Yes! #Saquon https://t.co/9rypa7v7PO","Oh another bad spot. Count me as shocked. #CFB #Sarcasm","@DrCoopsbeard No but its one of the softest schedules in all of cfb","Johnson’s late touchdown lifts Maryland to 31-24 win at Minnesota https://t.co/JDpLJ59Ov2 https://t.co/QmAvU0r7jE","[Game Thread] San José State @ UNLV (10:30PM ET) via /r/CFB https://t.co/cvYPbDMhfO","[Game Thread] Colorado @ UCLA (10:30PM ET) via /r/CFB https://t.co/wvxdnqUutA","[Game Thread] California @ Oregon (10:30PM ET) via /r/CFB https://t.co/prSay8mQPf","[Game Thread] Northern Illinois @ San Diego State (10:30PM ET) via /r/CFB https://t.co/mQfbTZrIee","[Postgame Thread] Auburn Defeats Mississippi State 49-10 via /r/CFB https://t.co/kf4zumJt8M","[Postgame Thread] Akron Defeats Bowling Green 34-23 via /r/CFB https://t.co/PvOMkpmulr","Tennessee LB Colton Jumper: Georgia not ‘as good as we made them out to be’ via /r/CFB https://t.co/m6dyTicJf1","[Postgame Thread] Western Carolina Defeats Chattanooga 45-7 via /r/CFB https://t.co/pMS83FsODv","Notre Dame Becomes Second Football Program To Win 900 Games. via /r/CFB https://t.co/zKbFTCv31O","@cmurphypro @CriddleBenjamin Sounds to me he is breaking down film, just not CFB film.","#CFB #D2FB #GAC #SmallCollegeFootball: Ouachita Baptist 35, Arkansas Tech 31 (Final). Tigers rally to hand the ATU their 1st loss. ATU 4-1.","Perhaps the CFB world needn't have gotten so excited over Mississippi State's thumping of LSU. Tigers losing to Troy at home tonight.","When you are on your way to becoming the best coach in #CFB #CLEMvsVT https://t.co/h9LSOoo1AS","Cain is the best WR in CFB. So smooth. Missed targeting call","NFL &gt;&gt;&gt;&gt;&gt;&gt;&gt; CFB","#CFB #D2FB #GAC #SmallCollegeFootball: Ouachita Baptist 35, Arkansas Tech 31 (Final). Tigers rally to hand ATU their 1st loss. OBU/ATU 3-1.","Someone who has time to look shit up can, but horrendous #UMass FB has to be the first CFB squad in history to be 0-6 by end of Sept","#CFB #D2FB #GAC #SmallCollegeFootball: Ouachita Baptist 35, Arkansas Tech 31 (Final). Tigers rally to hand ATU their 1st loss. OBU/ATU 4-1.","#CFB  Nevada +240 (1u)","@carolmceldowney @Motowncool @Dbo2353 @HelloHeisman21 Seriously!! I don't block them cause they make me laugh! No C… https://t.co/VseExjkVBT","@TheCasualRG CFB has better rules and management but NFL is way more entertaining","I would really love to see a Bama &amp; Clemson rematch in the CFB national championship","Love it Steve! #cfb https://t.co/q0HL12bLkc","I had to think of 5 coaches who would \"swipe left\" on the #Tennessee job. Man that was hard to pair down. #CFB https://t.co/6qQYrwYk7Z","CFB: J.T. Barrett becomes Ohio State’s all-time passing leader https://t.co/agnVrLfPb1","sportspoliticen: CFB: J.T. Barrett becomes Ohio State’s all-time passing leader https://t.co/u9mXJ9VZ1T","That was a touchdown #TexasTech #OklahomaState #CFB","@BigRedRadioCO I really believe that on Nov 24th UCF could be plying a nationally televised game against USF - maki… https://t.co/6PAfH774lm","Late night #Pac12FB. #OUvsCal and @HotRodsPicks likes @oregonfootball https://t.co/lfc1rbKC5H #CALvsOU #GoDucks… https://t.co/TPQiE7GaxH","#CFB LOOK: Draymond Green gets Defensive Player of Year trophy from idol Ben Wallace https://t.co/yxx0dfoXas","@Kroeger CFB sidebar, u go to @hornets practice or new fan shop? Any thoughts if so?","#CFB LOOK: Draymond Green gets Defensive Player of Year trophy from idol Ben Wallace https://t.co/yxx0dfoXas https://t.co/4v48jcATAC","Ahhh those were the days. https://t.co/OlSWJiIryO","So we're relying on #Pac12AfterDark to give us some kind of (competitive) drama in #CFB today?  We need it.","@ESPNBooger When are they going to fire the worst AD on CFB. He is killing LSU Athletics!","What an interesting cfb day. The strong get stronger. Bama, Ga, Aub. Others not so much, Tenn, LSU, State","There's plenty of drama in the #SEC, but it's more about whether or not the coaches will make it home alive. #cfb","@smokeynation They also walk in twice the size/speed as all other cfb players.","i'm gonna be furious if we lose in the black lids with the yellow O, they're the best helmets in CFB https://t.co/oecq0U27bB","@KCShankland And that's why I hate the rule in CFB. HATE it.","LagunaSlick is out! Today's poker news. https://t.co/wcQw4DTBhC Stories via @SplitSuit @MyTicketOps @_allinpoker_ #cfb","CFB is rigged against for money or something idk, not being silent I just saw it live srry.","The new hustle in cfb is to get a job at a P5 school with a huge buyout, fail horribly, then go on vacation","Troy 24, LSU 7 #CFB #SEC https://t.co/nJjheYDFnG","Abey, Navy’s running game grinds down Tulsa to stay unbeaten https://t.co/L42bkM7mti https://t.co/Jh5maIYbH6","@ClemsonFB Ryan Carter is playing corner crazy good. Shutdown corners are rare in #CFB He looks like one. Hope he can do this consistently","So a pick six by #Patterson and a #Hurts To #Hentges TD pass and the #CrimsonTide leads 21-0 and we're still in the… https://t.co/qo9f7dxsLC","They need to put Troy back in the top 25 we ain't no joke or pushover in CFB","@CFB Man he was Short! The only team he played against this year he got Smoked! No Refs Cheating for him!","WiFi and Directv on a CFB Saturday... I love you @JetBlue. ✈️🏈","100% this never happened. https://t.co/vV75Y0T1Nr","So a pick six by #Patterson and a #Hurts To #Hentges TD pass and the #CrimsonTide leads 21-0 and we're still in the… https://t.co/TR698uYVGg","🗣🗣🗣🗣 https://t.co/Nzf18xhZXB","15th Massive Play of the easiest touchdowns you’ll see https://t.co/gqOm5KXupC #CFB","Sports Photos! #NCAAF #CFB #MSSTvsAUB: https://t.co/tyARf4CBch","@TheLASooner Their fanbase is the armpit of CFB","Crowds don't mean shit in CFB. I'm sorry but it looks good for tv 🤷🏽‍♂️ https://t.co/E6474MtMQx","CFB Week 5's Most  https://t.co/l14VbpHlke","@Dune_in_Katy @dustinbennett76 Well I got the all female party right?...no real man gets drugged to no damn pink bday party on CFB day. lol","#CFB #D2FB #LSCfb #SmallCollegeFootball: Eastern New Mexico 28, West Texas A&amp;M 14 (Final).","The Ohio/UMass total was 53? Wow. #CFB","Expecting more of these in the second half. Go Pokes from Bermuda! #cfb #okstate #babymoon… https://t.co/Vnyw5kdQqe","@JulianCouncil yes...and when App State wins the conference, they will rightfully get a spot in the CFB Playoff.","Villanova pulls away from Towson late in 24-9 final https://t.co/5OKxwJMWzb https://t.co/J2abBKMIaA","Absolutely love this combo. Best jerseys in CFB! #QUACK https://t.co/LYRTPfWoHb","@JaxStateSports opens @OVCSports play with a 34-7 road win at @tennesseetech #jaxstate #gamecocks #ovc #CFB #JSUvsTT https://t.co/CS0O8GnKlD","Sapevo che l'attacco di Miss State si sarebbe sciolto come neve al sole dopo la vittoria con LSU  #MSSTvsAUB #CFB","The @bigten has the best @CFB teams....😀","Scrolling through top 25 CFB scores and nary a one was even close today. Remind me again why College FB is so much better than the NFL...","@ChantelJennings Making sweeping statements about the CFB landscape based on one half of football? Seems a bit ridiculous.","That targeting rule in CFB is stupid as fuck","🗣 watch out CFB we know how to throw TDs now #RollTide","RT TylerJacobsSTAD: Second half of MT_FB + FAU_Football can be seen NOW.  FREE CFB for #cordcutters thanks to Watc… https://t.co/SCURSkegZj","Bama is the most dominant team in CFB hand down","E vedrai che LSU la porta a casa #CFB","@darrenrovell The CFB talent in state of Alabama is deep. Bama Auburn and #Troy.","The dudes at Fox Sports are turrible CFB pundits.","In this weeks primetime matchup #VT is down two touchdowns to #Clemson in a 2016 #ACC Championship rematch. Second half coming up. #CFB","How awful is the #SEC ? Alabama is amazing; Georgia is good. But my God, LSU, A&amp;M, Tennessee, Ole Miss, Ark &amp; Miss St completely blow. #CFB","@matthewwalther Up with cfb tweeting. Louisville dominated their fcs opponent; Clemson looks to do same.","#Football #Forum After watching a day of CFB... https://t.co/ATng8GqjMV","jess in high school: \"wait espn is the channel with sports right?\"  jess now: SATURDAYS ARE FOR CFB","@joelklatt @GusJohnsonFOX Great call, tonight Gentlemen! Best team team currently in CFB Wreck'em Tech!!! #Fox #Espn","09/30/17 CFB PICKS:  Bowling Green +128 * 0.7U ✖️ Troy +20.5 -102 * 0.5U ✔️","jess in high school: \"wait espn is the one with the sports right?\"  jess now: \"clemson fb is my life saturdays are for cfb\"","4-3-1 9th Super Underdog Special: CFB Mississippi State vs Auburn: Mississippi State ML LOSS #TrustKingArnsaw","Just catching up on the day in #cfb = holy. moly. MESS.","4-4-1 10th Locks of the Year Easy Money: CFB Mississippi State vs Auburn: Mississippi State +8 LOSS #TrustKingArnsaw","Exhibit 134 on why there should be no CFB rankings until October. https://t.co/0IohAyF17G","4-5-1 11th Locks of the Year Easy Money: CFB Memphis vs Central Florida: Memphis +6 LOSS #TrustKingArnsaw","Is there a #CFB TV crew on any network that does anything but call for targeting on almost any physical hit? Not one objective crew left.","Watching NBA preseason instead of the Primetime CFB game of the night. So ready for this season.","A away game in CFB and Virginia Tech c'est quand même mon entrée préférée en CFB.","San Jose St +17 (-115) #CFB #NCAAF","I'm really excited to drink beer on my couch and watch west coast college football until I pass out. #CFB","@itsmissmandymac @bee_tee_ess If only your PhD was from Bama you'd have the CFB duo of excellence.","@BarrettTomek Saturday nights belong to CFB in the fall but man that is tempting.","Saquon is amazing! #26 https://t.co/g0ARCydpxP","Natty Bound😤 WE DESERVE TO BE IN THE CFB PLAYOFF 🐏😈💪🏼 https://t.co/TNzjplBfvm","I really don't think anyone in CFB can beat Alabama... I'm calling a undefeated season #RTR","Red ALERT PLAY 🔥 🔥 🔥💵💵💵💵💵:UCLA-4 first half cfb at 10:30 pm est💵💵Bet whatever you can afford rent money ,car payment guarantee double up😀😀😀","Meanwhile, in Knoxville... https://t.co/bqSpEiHBxB #UGAvsTenn #cfb #collegefootball","@lvsportswinning #CFB in progress:  188 Florida Atlantic -   https://t.co/hAR0ZPGmV6","So you want to be a fan of a CFB team? Get ready for infuriating fumbles, penalties, defensive schemes and hair loss. #TroyvsLSU",".@HoosierFootball landed 945p after #INDvsPSU UNV ➡️ BMG UAL2532 | N26226 | B738 📡https://t.co/rzHhF66vAJ… https://t.co/oGI9g2vOQY","My CFB Top 10 after today: 1. Bama  2. Clem 3. PSU  4. OU 5. Georgia  6. Wash 7. Wash St 8. TCU 9. Mich 10. WISC","It’s Time for #Marshall Thundering Herd Football Wall Clock #NCAA #cfb #WeAre #GoHerd @HerdZone… https://t.co/h2cyKiuDa3","#CFB  Northern Illinois +298 (2u) Hawaii +218 (1u)","The State of Mississippi is not doing well in #CFB #MSST got crushed earlier today and right now #OleMiss is gettin… https://t.co/tq5RAKjgU5","@UniformReview One of the better looks in CFB..","[Postgame Thread] Georgia Defeats Tennessee 41-0 https://t.co/YX2IdoUgpN #cfb","0-3  -3.20 No excuses. https://t.co/gIJYQmmADM","@CoachMcElwain is the man! 3-0 in SEC play again! 2 time SEC East! 9-1 in one possession games, tops in CFB! Well done coach-Axios!!!","Cincy #CFB RT @jeffmarshallep: @[me] 9:00 remaining. Uc v Marshall. Woof. https://t.co/c4yPKoGA3r","It’s Time for Oklahoma State Cowboys Football Wall Clock #NCAA #cfb #okstate #OSUvsTTU #CowboyUp… https://t.co/iPHW08DmHJ","CFB Situation... offense driving, down one. Defensive player injured under one minute and offense charged 10-second runoff. #makesnosense","Purdue-ND is an all time great CFB rivalry. Purdue has had 7 coaches in my lifetime. Tiller is the only to beat ND: He beat them 5 times.","Oklahoma State Cowboys Hoodie #NCAA #CFB #OSUvsTTU #OKState  https://t.co/k1k1iPRGUr","@ItsMarcell is the most underrated CFB player in the nation.","And away I go!!! @ CFB Esquimalt https://t.co/2FWHkqvvvx","My dogs turned from CFB to preseason NBA Basketball.. https://t.co/LGf7XEEQQv","The odd comparison of football crowds VS futbol crowds for FC Cincy at sane park https://t.co/E41BeGghtJ","Okay my love for Jim McIvaine was solid before, it is now solidified in stone. Best coach in CFB! https://t.co/0mmjR4vswV","#CFB #GroupOf5 #SunBelt: Louisiana-Monroe 45, Coastal Carolina 43 (2:58, 4th Quarter)","@jhm8806 Bama will always be number 1 unless they lose, that’s how CFB works","Enter Sandman...VT...probably best entrance in CFB https://t.co/HLLwtthfsc #collegefootball","@CFB REALLY?  U really think so?  BAMA will be the ones Rollin trees in AU this year!","#soccercity https://t.co/MZAzDPbb23","N W K https://t.co/Z88cDNRAhy","Bryce Love has more 50+ yard runs (7) than any other TEAM in CFB!  New Blove Heisman hashtag #ComeGetAllThisLove  USE it!  @GoStanford","Question 28: One time in CFB and he still won't be as good down the stretch..","Ed Orgeron was the dumbest hire in CFB","@WildcatRadioAZ Cecil is a DB coach and that is it.  JS is a good DL coach.  Both have zero credibility as a CFB HC.","@BIGWUBBS One of the iconic ones in CFB! Enter Sandman - even sounds cool 👍🏼","[Postgame Thread] FIU Defeats Charlotte 30-29 via /r/CFB https://t.co/hdX7bFmx3y","@pmmullins13 Yep..Paul knows his CFB. You know someone who always win?","[Postgame Thread] Louisiana Tech Defeats South Alabama 34-16 via /r/CFB https://t.co/cPpDh8Rkc1","[Postgame Thread] UCF Defeats Memphis 40-13 via /r/CFB https://t.co/vftBpHsghv","[Postgame Thread] Southeast Missouri State Defeats Eastern Kentucky 29-10 via /r/CFB https://t.co/35o5lt1VFp","[Postgame Thread] Youngstown State Defeats South Dakota State 19-7 via /r/CFB https://t.co/qPrakNrZje","With 7 seconds left the Bearcats take the lead and continue the nation's longest winning streak at 35. via /r/CFB https://t.co/hZ6euYyc1O","Why CFB is the best https://t.co/JaOXJgiFR9","We're in the 4th on 103.3 FM ESPN and the #Gamecocks are leading over the #Aggies 17-10! Tune in as the clock ticks down on the game! #CFB","Every room that I’ve taken room sevice to tonight has had some CFB game on. 21c’s guests are alright. 😏👏🏼","Let's make this the normal crowd (at best) at NFL games. https://t.co/W7K7gghJOW","Lol https://t.co/Bo44qFNx3F","Lol. This Bama play is such a great example of what a joke the targeting penalty is in CFB","if you say LSU lost to Demarcus Wares old team then it doesnt sound as bad #LSUFootball #CFB #SECNation","Wow ... @TroyTrojansFB gets the win on the road at #LSU! Big time win for the #Troy program! #CFB #SunBelt #SEC #UpsetAlert","REAL CFB FINAL SCORE:   TROY 24 #25 LSU 21","TROJANS! https://t.co/LfPQXv4Ais","@B_Y_3 Lol.. your cute gif shows me how little you know about CFB.. don’t know which part of my statement you’re confused about..","Tech the most overrated program in history of CFB. Never win anything 😂😂😂","Troy. In Death Valley.  CFB is the best.","Tech the most overrated program in history of CFB. Never win anything 😂😂😂","TROY TROJANS!!! #CFB #TroyVsLSU","Chalk bettors having a good time in CFB today.","Lmaooo https://t.co/CPAepbIulu","CFB:  Oregon -17 N Illinois +9.5","Holy snickerdoodles 😱 https://t.co/7Jqsu4WLiM","Will #DeathValley take on a new meaning for #CoachO tonight? #LSU #Troy #NCAA #CFB","I don’t know a lot about CFB, but I don’t think LSU is supposed to lose to Troy","MORE GOOD NEWS! https://t.co/Z64GixQdS7",".@ClemsonFB is the best team in #CFB !!! Up 24-3 over @HokiesFB 👀Wow! #CLEMvsVT #Clemson #CollegeGameDay https://t.co/tKVBgELYpP","Twitter CFB Free Play #4  Oregon Ducks -16 https://t.co/VXfI6ACmRe","Clemson is the best team in CFB right now. And it's not close.","Have a feeling they might drop out of the rankings. https://t.co/wXJiL67dV3","@CFBHeather Isn't #CFB the greatest, Heather?! Every week we have great games and even better upsets!","#Troy upsets #LSU by sealing the game with an interception on the final play. #CFB https://t.co/NHDDoCyOPR","Saturday night loss to @TROYUnews in Baton Rouge, huh? How's that Les Miles firing working out for @LSUfootball? #TROYvsLSU #CFB #LSU","Djxjxjxjx LETS GO TROJANS!!! https://t.co/ZEJcIioRST","Joe Alleva is the worst AD in college sports. Ed Orgeron is the worst coach in CFB. That is all.","shouldn't have been so close at the end... Troy dominated this game... #CFB https://t.co/1nQGXHDooU","CFB   Northern Illinois / SD st under 47.5","Seaux sorry 😂 https://t.co/800zosrFw9","It's OK, Coach O, Nick Saban lost to UAB at LSU in his first season. I'm sure things will work out just as well for… https://t.co/GxU0bJM4kQ","@bmf1314 Troy \"upsetting\" LSU in Baton Rogue doesnt scratch your CFB itch?","bro what if we see another Clemson vs Alabama CFB Championship","@CaseyOld @realJStratman #SEC West clearly best division in CFB. Bwahaha!!!","😂😂😂😂 https://t.co/b3bskStKit","CAE LSU. Los Tigers llevaban 49 juegos en fila defendiendo su casa contra equipos fuera del SEC. Hoy, Troy hace la… https://t.co/FTOnuewTpL","It’s Time for Texas Tech #RedRaiders Football Wall Clock #NCAA #cfb #GunsUp #Wreckem #TTUvsOSU… https://t.co/oZeonlDDYp","The best in CFB. More teams should step up the entrances https://t.co/9nTQixTSKo","I know it's all about CFB right now, but here's some breaking news. https://t.co/tVgj1PwlvD","Somewhere Coach Les Miles is smiling @CFBOpinion @LSUfootball #cfb #CFBGamedayGirls @CFBGamedayGirls","Most underrated coach in CFB https://t.co/wB24fpGwY6","Is it me or is CFB wild as fuck this year","SEC!!! LMFAOOOOO https://t.co/srU9T7fejT","@PimpinVanSmack LOL. https://t.co/viIKWQKtnt","@CFBHeather Troy v Bama in CFB Finals?","We Are playing #FantasyFootball  at @FanDuel. Come join us &amp; get $10 to play! #FanDuel #NFL #CFB   Terms apply. https://t.co/Hc2TL9M14X","Mason Rudolph is as a good of a pure thrower as anyone in CFB, but does he make the team around him better?  Eh... that's not clear.","@LoveMissSarcasm unfollowing until CFB is over lol love u bye","Way to represent my name Troy! #CFB","Clemson and Bama are far and away the best 2 teams in CFB","YOU LET ONE PERSON BEAT YOU, LSU?! https://t.co/kM651324zX","#LeaveNoDoubt. Dem #ClemsonTigers' #CFB #Championship focused! https://t.co/NMqrPFP9mX","Wow, LSU just took a huge L, way to go Troy! #TROYvsLSU #CFB","#LSU is this year’s poster child for why there should be no #CFB polls until the second week of October.","Lololololol https://t.co/mHp4upZGDt","Highest-paid coaching staff in CFB, right?","LOLSU. #GeauxTrojans #CFB https://t.co/QeBFQlQ4Uj","Havent seen any CFB this year but LMAO TROY BEAT LSU?! FIRE EVERYONEEEE","Bloody Monday coming in CFB?","Last time @TroyTrojansFB beat a ranked foe, one of the COOLEST plays in CFB history happened...  https://t.co/mZ4CANUcel","Favorite thing about #CFB - I can start watching at noon, &amp; 10 1/2 hours later…There are still multiple gms that have yet to kickoff!","Seriously, how are MSU, LSU and the Gators all ranked? Is it that much of a down year talent wise in CFB?","Feel confident in SAYING 3 of the top 4 #CFB teams are from the South.. ALA, CLEM, UGA..field picks the 4th!!!","@jg9188 Definitely not the strongest conference in CFB right now.","😂😂😂😂😂😂😂😂😂 https://t.co/sQQiLkxJaP","LSU football is not safe to pull up on your work computer’s internet browser. https://t.co/XbS9RWaqKY","@randyharvey Sure. It's almost like CFB is too much about politics and not enough about actual play. Nah, can't be.… https://t.co/lAcxjEVMU3",".@USFFootball back @ 659p from #USFvsECU PGV ➡️ TPA AAY4902 | N233NV | A320 📡https://t.co/ChqWyPeUsy #FlightRadar24… https://t.co/vsNcdw30ww","worst week of cfb","Heads are gonna roll in Baton Rouge! Yikes. #TroyvsLSU #LSU #CFB #BCS #Troy","Love CFB upsets! https://t.co/d9M4hCCosk","Major upset, but #Troy is a solid football team. No one should take them lightly.  #LSUvsTROY #LSU https://t.co/PVmlMSe5yH","#Troy upsets No. 25 #LSU 24-21, sealed by game-winning interception in final seconds #CFB","Well as if we needed any more proof that the #SEC is not the best conf in CFB we have it in #LSUvsTROY. The #ACC and Big Ten&gt;SEC.","@TroyTrojansFB shocks @LSUfootball with a 24-21 win in Baton Rouge (AP Photo/Matthew Hinton) #troyvslsu #Trojans… https://t.co/evkpN8Srj5","Welp... https://t.co/B3gKESwp3B","lol https://t.co/7XP6go65jC","if that stands idk know what any penalties are #CFB @ncaa #BS","This makes me feel better about USC losing to dumb ole Washington State last night https://t.co/Lrzhmc9Mqr","the scene in baton rouge is pretty grim tonight...#Huskers fans know the feeling...had it 2 weeks ago...#CFB","@eliknowsall about to fly back to Dallas and checked up on CFB... God bless America","Oh, that Ed Orgeron hire by LSU... #TroyvsLSU #CFB #SEC","Florida's gotta like it's chances next week https://t.co/r70S8bStGR","Never betting CFB again. TROY of all teams https://t.co/By8adUj63x","LSU had 2nd longest no conference win streak in CFB history at 49 games...who derailed them? https://t.co/5HboOamr7j","@NxiPicks Nice day of CFB NXI...","Targeting calls in CFB are getting out of hand","@Brett_McMurphy @brentbeaird Too much to ask to have one decent CFB game with ranked opponents?Every conference has 1-2 good teams it seems","Bama, Clemson, and Georgia are the best teams in CFB right now","Lol, in \"Death Valley\" at that... https://t.co/3yYHdMGjrC","[Postgame Thread] Kentucky Defeats Eastern Kentucky 29-10 via /r/CFB https://t.co/5Ah8Wpub1P","#CFB #GroupOf5 #SunBelt: Louisiana-Monroe 51, Coastal Carolina 43 (Final)","It’s confusing when the Transitive Win Theory of CFB points to a 2-2 team being...actually good.","The definition of fed up https://t.co/OfdA12kYak","Hats off to the \"other\" B. Silvers and the @TroyTrojansFB team on a quality W. #CFB @SunBelt #FunBelt https://t.co/5ZvOk7QhtK","#CFB S.C.'s Googer carted off; moving arms, legs - S.C.'s Googer carted off; moving arms, legs https://t.co/LOCBUBua2f","@geoffjBYU Oh my gosh. Nobody messes with Boney. Screw CFB man.","seriously i wanna see our targeting numbers the past 5 years compared to rest of cfb #gigem #aggies #12thman #SCvsTAMU","9795743558 https://t.co/ApmYoJX3SH","@Lil_RonDawg_LVG I’m talking about the CFB finals bro lol","@cassel191919 @SWiltfong247 Obviously you haven't watched a full cfb game in forever. Prob an osu fan.","It’s Time for Washington #Huskies Football Wall Clock #NCAA #cfb #Pac12AfterDark #UW #PurpleReign #WASHvsOSU…… https://t.co/RbCIrCNOnK","@SEC Your refs are terrible. It's unfortunate that the best league in CFB has some of the worst refs.","Nobody in #CFB looks remotely capable of hanging with Bama or Clemson","@HoskinsGOAT Idk either. Want to get into CFB but don't know which team to go for","@MKonSports CFB is my lane...",".@VandyFootball home at 555p. from #VANDYvsUF GNV ➡️ BNA DAL8912 | N553NW | B752 📡https://t.co/V8b1dBLtGP… https://t.co/D3kVntxkLq","@Lil_RonDawg_LVG I’m talking about the CFB championship bro lol"]}